Revit 2026 API

# LevelCreate Method

---

Creates a new instance of level based on an input elevation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Level Create(
	Document document,
	double elevation
)
```
```vb
Public Shared Function Create (
	document As Document,
	elevation As Double
) As Level
```
```cpp
public:
static Level^ Create(
	Document^ document,
	double elevation
)
```
```fsharp
static member Create :
        document : Document *
        elevation : float -> Level
```

#### Parameters

document Document
     The document in which the new instance is created
elevation Double
     The elevation of the level to be created.

#### Return Value

Level The newly created level instance.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Level Class

Autodesk.Revit.DB Namespace